BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.c
/***************************************************************************//**
* \file `$INSTANCE_NAME`_SensingCSX_LL.c
* \version `$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION`
*
* \brief
*   This file defines the data structure global variables and provides
*   implementation for the low-level APIs of the CSX part of
*   the Sensing module. The file contains the APIs used for the CSD block
*   initialization, calibration and scanning.
*
* \see CapSense v`$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION` Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/
#include "syslib/cy_syslib.h"
#include "gpio/cy_gpio.h"

#include "cy_device_headers.h"
#include "cyfitter_gpio.h"
#include "cyfitter_sysint_cfg.h"

#include "`$INSTANCE_NAME`_ModClk.h"
#include "`$INSTANCE_NAME`_Structure.h"
#include "`$INSTANCE_NAME`_Configuration.h"
#include "`$INSTANCE_NAME`_SensingCSX_LL.h"
#include "`$INSTANCE_NAME`_Sensing.h"
`$CY_API_CALLBACK_HEADER_INCLUDE`

#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_EN)

/*******************************************************************************
* Function constants
*******************************************************************************/

#define `$INSTANCE_NAME`_MOD_CSD_CLK_12MHZ                      (12000000uL)
#define `$INSTANCE_NAME`_MOD_CSD_CLK_24MHZ                      (24000000uL)
#define `$INSTANCE_NAME`_MOD_CSD_CLK_48MHZ                      (48000000uL)

#define  `$INSTANCE_NAME`_NUM_HALF_CYCLES                       (2u)


/*******************************************************************************
* Defines module variables
*******************************************************************************/

/* Local variable used to store the Scan period */
volatile uint16 `$INSTANCE_NAME`_csxScanPeriod = 0u;
/* Local variable used to return RawCount from the post scan ISR */
volatile uint16 `$INSTANCE_NAME`_csxRawCount = 0u;
volatile uint32 `$INSTANCE_NAME`_resamplingCyclesCnt = `$INSTANCE_NAME`_RESAMPLING_CYCLES_MAX_NUMBER;
/* Pointer to Flash structure to hold Tx electrode that was connected previously */
static `$INSTANCE_NAME`_FLASH_IO_STRUCT const *`$INSTANCE_NAME`_curTxIOPtr;
/* Pointer to Flash structure to hold Rx electrode that was connected previously */
static `$INSTANCE_NAME`_FLASH_IO_STRUCT const *`$INSTANCE_NAME`_curRxIOPtr;
/* Local variable to hold total Tx in widget, while scanning all sensors in widget */
static uint16 `$INSTANCE_NAME`_curWdgtTotalRx = 0u;
/* Local variable to hold total Rx in widget, while scanning all sensors in widget */
static uint16 `$INSTANCE_NAME`_curWdgtTotalTx = 0u;
/* Flag to indicate that electrodes were connected previously */
static uint16 `$INSTANCE_NAME`_eleCsxDisconnectFlag = 0u;
/* Pointer to Flash structure holding info of sensor to be scanned */
#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_GANGED_SNS_EN)
    static `$INSTANCE_NAME`_FLASH_SNS_STRUCT const *`$INSTANCE_NAME`_curGangRxPtr = 0u;
    static `$INSTANCE_NAME`_FLASH_SNS_STRUCT const *`$INSTANCE_NAME`_curGangTxPtr = 0u;
#endif

/*******************************************************************************
* Module local function declarations
*******************************************************************************/
/**
* \if SECTION_CAPSENSE_INTERNAL
* \addtogroup group_capsense_internal
* \{
*/

static void `$INSTANCE_NAME`_SsCSXStartSample(void);
static void `$INSTANCE_NAME`_SsCSXPostMultiScan(void);
static void `$INSTANCE_NAME`_SsCSXPostSingleScan(void);
static uint16 `$INSTANCE_NAME`_SsCalcCsxScanPeriod(`$INSTANCE_NAME`_RAM_WD_BASE_STRUCT const *wdgtPtr);
__STATIC_INLINE void `$INSTANCE_NAME`_SsCSXStartSampleExt(void);

#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
    uint32 `$INSTANCE_NAME`_SsCSXOversample(void);
#endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */

#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_GANGED_SNS_EN)
    static void `$INSTANCE_NAME`_SsCSXPostMultiScanGanged(void);
#endif

/* Pointer to Pointer to function used to register callback in ISR */
void (*`$INSTANCE_NAME`_CSXPostScanApiPtr)(void) = &`$INSTANCE_NAME`_SsCSXPostMultiScan;
/** \}
* \endif */

