BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.c
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSXInitialize
****************************************************************************//**
*
* \brief
*   Performs hardware and firmware initialization required for the CSX operation
*   of the CapSense component.
*
* \details
*   This function initializes hardware to perform the CSX sensing operation. This
*   function is called by the `$INSTANCE_NAME`_Start() API during the component
*   initialization. If both CSX and CSD sensing methods are used in the component,
*   this function is called by the `$INSTANCE_NAME`_SetupWidget() API to change hardware
*   configured for CSD to re-initialise for the CSX sensing.
*
*   If the CSD and CSX widgets are used in the component, it is recommended not to
*   mix the CSD widgets between the CSX widgets, instead, place all CSX widgets in
*   the required scanning order and then place the CSD widgets in the customizer.
*   For the component API, this action will eliminate the need for changing the hardware
*   configuration for every widget scan and will increase the execution speed
*   in the `$INSTANCE_NAME`_ScanAllWidgets() when the API is called.
*
*   Similarly, it is recommended to set up and scan all the CSX widgets in such
*   a sequence that the `$INSTANCE_NAME`_SetupWidget() API  shouldn't need
*   hardware  sensing-configuration change.
*
*   It is highly not recommended to call this API directly from the application layer.
*
*******************************************************************************/

void `$INSTANCE_NAME`_CSXInitialize(void)
{
    uint32 interruptState;
    uint32 tmpRegVal;

    Cy_GPIO_SetDrivemode(`$INSTANCE_NAME`_CintA_0_PORT, `$INSTANCE_NAME`_CintA_0_NUM, `$INSTANCE_NAME`_CintA_0_DRIVEMODE);
    Cy_GPIO_SetDrivemode(`$INSTANCE_NAME`_CintB_0_PORT, `$INSTANCE_NAME`_CintB_0_NUM, `$INSTANCE_NAME`_CintB_0_DRIVEMODE);

    /* Clear all pending interrupts of CSD block */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_INTR_PTR,             `$INSTANCE_NAME`_CSD_INTR_ALL_MSK);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_INTR_SET_PTR,         `$INSTANCE_NAME`_DEFAULT_CSD_INTR_SET_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_INTR_MASK_PTR,        `$INSTANCE_NAME`_DEFAULT_CSD_INTR_MASK_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_HSCMP_PTR,            `$INSTANCE_NAME`_DEFAULT_CSD_HSCMP_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_AMBUF_PTR,            `$INSTANCE_NAME`_DEFAULT_CSD_AMBUF_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_REFGEN_PTR,           `$INSTANCE_NAME`_DEFAULT_CSD_REFGEN_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_CSDCMP_PTR,           `$INSTANCE_NAME`_DEFAULT_CSD_CSDCMP_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_IDACA_PTR,            `$INSTANCE_NAME`_DEFAULT_CSD_IDACA_CFG);

    #if((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_ADC_EN) || (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_IDACB_USED))
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_IDACB_PTR,    `$INSTANCE_NAME`_DEFAULT_CSD_IDACB_CFG);
    #endif /* (0u != `$INSTANCE_NAME`_ADC_EN) || (0u != `$INSTANCE_NAME`_IDACB_USED) */

    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_RES_PTR,           `$INSTANCE_NAME`_DEFAULT_CSD_SW_RES_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SENSE_PERIOD_PTR,     `$INSTANCE_NAME`_DEFAULT_CSD_SENSE_PERIOD_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SENSE_DUTY_PTR,       `$INSTANCE_NAME`_DEFAULT_CSD_SENSE_DUTY_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_PTR,      `$INSTANCE_NAME`_DEFAULT_CSD_SW_HS_P_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_HS_N_SEL_PTR,      `$INSTANCE_NAME`_DEFAULT_CSD_SW_HS_N_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_PTR,    `$INSTANCE_NAME`_DEFAULT_CSD_SW_SHIELD_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_AMUXBUF_SEL_PTR,   `$INSTANCE_NAME`_DEFAULT_CSD_SW_AMUXBUF_SEL_CFG);

    interruptState = Cy_SysLib_EnterCriticalSection();
    tmpRegVal = CY_GET_REG32(`$INSTANCE_NAME`_CSD_SW_BYP_SEL_PTR);
    tmpRegVal &= ~(`$INSTANCE_NAME`_CSD_SW_BYP_SEL_SW_BYA_MSK);
    tmpRegVal |= `$INSTANCE_NAME`_DEFAULT_CSD_SW_BYP_SEL_CFG;
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_BYP_SEL_PTR,       tmpRegVal);
    Cy_SysLib_ExitCriticalSection(interruptState);

    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_CMP_P_SEL_PTR,     `$INSTANCE_NAME`_DEFAULT_CSD_SW_CMP_P_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_CMP_N_SEL_PTR,     `$INSTANCE_NAME`_DEFAULT_CSD_SW_CMP_N_SEL_CFG);

    interruptState = Cy_SysLib_EnterCriticalSection();
    tmpRegVal = CY_GET_REG32(`$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_PTR);
    tmpRegVal &= ~`$INSTANCE_NAME`_DEFAULT_CSD_SW_REFGEN_SEL_MSK;
    tmpRegVal |= `$INSTANCE_NAME`_DEFAULT_CSD_SW_REFGEN_SEL_CFG;
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_PTR,    tmpRegVal);
    Cy_SysLib_ExitCriticalSection(interruptState);

    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_PTR,    `$INSTANCE_NAME`_DEFAULT_CSD_SW_FW_MOD_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_PTR,   `$INSTANCE_NAME`_DEFAULT_CSD_SW_FW_TANK_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_DSI_SEL_PTR,       `$INSTANCE_NAME`_DEFAULT_CSD_SW_DSI_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_IO_SEL_PTR,           `$INSTANCE_NAME`_DEFAULT_CSD_SW_IO_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SEQ_TIME_PTR,         `$INSTANCE_NAME`_DEFAULT_CSD_SEQ_TIME_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SEQ_INIT_CNT_PTR,     `$INSTANCE_NAME`_DEFAULT_CSD_SEQ_INIT_CNT_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SEQ_NORM_CNT_PTR,     `$INSTANCE_NAME`_DEFAULT_CSD_SEQ_NORM_CNT_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_ADC_CTL_PTR,          `$INSTANCE_NAME`_DEFAULT_CSD_ADC_CTL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SEQ_START_PTR,        `$INSTANCE_NAME`_DEFAULT_CSD_SEQ_START_CFG);

    `$INSTANCE_NAME`_ModClk_SetDivider((uint32)`$INSTANCE_NAME`_dsRam.modCsxClk - 1uL);

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_COMMON_TX_CLK_EN)
        `$INSTANCE_NAME`_SsSetSnsClockDivider((uint32)`$INSTANCE_NAME`_dsRam.snsCsxClk);
    #endif

    /* Set all IO states to default state */
    `$INSTANCE_NAME`_SsSetIOsInDefaultState();

    /* Enable CSD block interrupt and set interrupt vector to CSX sensing method */
    `$INSTANCE_NAME`_SsIsrInitialize(&`$INSTANCE_NAME`_CSXScanISR);
}


