BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.c
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSXElectrodeCheck
****************************************************************************//**
*
* \brief
*   Check if electrodes were previously connected using
*   the `$INSTANCE_NAME`_CSXSetupWidgetExt() API and if yes, disconnect them.
*
* \details
*   This function checks if `$INSTANCE_NAME`_eleCsxDisconnectFlag is set.
*   If it is set, the function disconnects the previously connected electrode.
*
*******************************************************************************/
void `$INSTANCE_NAME`_CSXElectrodeCheck(void)
{
    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_GANGED_SNS_EN)
        uint32 numElectrodes;
    #endif /* (0u != `$INSTANCE_NAME`_CSX_GANGED_SNS_EN) */

    if (0u != `$INSTANCE_NAME`_eleCsxDisconnectFlag)
    {
       /* Disconnect if electrodes were previous connected by SetupWidgetExt() API */
        #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_GANGED_SNS_EN)
            /* Check ganged sns flag */
            if (`$INSTANCE_NAME`_GANGED_SNS_MASK == (`$INSTANCE_NAME`_curFlashWdgtPtr->staticConfig & `$INSTANCE_NAME`_GANGED_SNS_MASK))
            {
                /* 1. Get number of pins in previous connected Tx electrode
                    3. Get Tx pointer
                    4. Disconnect all Tx */
                numElectrodes = `$INSTANCE_NAME`_curGangTxPtr->numPins;
                `$INSTANCE_NAME`_curTxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangTxPtr->firstPinId];

                do
                {
                    `$INSTANCE_NAME`_CSXDisconnectTx(`$INSTANCE_NAME`_curTxIOPtr++);
                    numElectrodes--;
                } while (0u != numElectrodes);

                /* 1. Get number of pins in previous connected Rx electrode
                    3. Get Rx pointer
                    4. Disconnect all Rx */
                numElectrodes = `$INSTANCE_NAME`_curGangRxPtr->numPins;
                `$INSTANCE_NAME`_curRxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangRxPtr->firstPinId];

                do
                {
                    `$INSTANCE_NAME`_CSXDisconnectRx(`$INSTANCE_NAME`_curRxIOPtr++);
                    numElectrodes--;
                } while (0u != numElectrodes);
            }
            else
            {
                /* Disconnect if electrodes were previous connected by SetupWidgetExt API */
                `$INSTANCE_NAME`_CSXDisconnectTx(`$INSTANCE_NAME`_curTxIOPtr);
                `$INSTANCE_NAME`_CSXDisconnectRx(`$INSTANCE_NAME`_curRxIOPtr);
            }
        #else
            /* Disconnect if electrodes were previous connected by SetupWidgetExt API */
            `$INSTANCE_NAME`_CSXDisconnectTx(`$INSTANCE_NAME`_curTxIOPtr);
            `$INSTANCE_NAME`_CSXDisconnectRx(`$INSTANCE_NAME`_curRxIOPtr);
        #endif
        `$INSTANCE_NAME`_eleCsxDisconnectFlag = 0u;
    }
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSXSetupWidget
****************************************************************************//**
*
* \brief
*  Performs hardware and firmware initialization required for scanning sensors
*  in a specific widget using the CSX sensing method. This function requires
*  using the `$INSTANCE_NAME`_CSXScan() function to start scanning.
*
* \details
*  This function initializes the widgets specific common parameters to perform
*  the CSX scanning. The initialization includes the following:
*    1. The CSD_CONFIG register.
*    2. The IDAC register.
*    3. The Sense clock frequency
*    4. The phase alignment of the sense and modulator clocks.
*
*  This function does not connect any specific sensors to the scanning hardware
*  and neither does it start a scanning process. The `$INSTANCE_NAME`_CSXScan()
*  function must be called after initializing the widget to start scanning.
*
*  This function is called when no scanning is in progress. I.e.
*  `$INSTANCE_NAME`_IsBusy() returns a non-busy status.
*
*  This function is called by the `$INSTANCE_NAME`_SetupWidget() API if the
*  given widget uses the CSX sensing method.
*
*  Calling this function directly from the application layer is not
*  recomended. This function is used to implement only the user's specific
*  use cases (for faster execution time or pipeline scanning for example).
*
* \param widgetId
*  Specifies the ID number of the widget to perform hardware and firmware
*  initialization required for scanning sensors in the specific widget.
*  A macro for the widget ID can be found in the `$INSTANCE_NAME` Configuration header
*  file defined as `$INSTANCE_NAME`_<WidgetName>_WDGT_ID.
*
*******************************************************************************/
void `$INSTANCE_NAME`_CSXSetupWidget(uint32 widgetId)
{
    /* variable to access widget details    */
    `$INSTANCE_NAME`_RAM_WD_BASE_STRUCT * curRamWdgtBasePtr;

    uint32 tmpRegVal;
    uint32 snsClkVal;

    #if ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_CSX_EN) || \
        (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_SELF_TEST_EN) || \
        (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_ADC_EN))
         `$INSTANCE_NAME`_SsSwitchSensingMode(`$INSTANCE_NAME`_SENSE_METHOD_CSX_E);
    #endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_CSX_EN) || \
               (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_SELF_TEST_EN) || \
               (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_ADC_EN)) */

    /*  Check if CSX electrodes were previously connected using
        `$INSTANCE_NAME`_CSXSetupWidgetExt API and if yes, disconnect them  */
    `$INSTANCE_NAME`_CSXElectrodeCheck();

    /* Save the current widget Id */
    `$INSTANCE_NAME`_widgetIndex = (uint8)widgetId;

    /* Configure hardware block */
    `$INSTANCE_NAME`_curFlashWdgtPtr = &`$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId];

    curRamWdgtBasePtr = (`$INSTANCE_NAME`_RAM_WD_BASE_STRUCT *)`$INSTANCE_NAME`_curFlashWdgtPtr->ptr2WdgtRam;

