BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.c
    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_COMMON_TX_CLK_EN)
        snsClkVal = (uint32)`$INSTANCE_NAME`_dsRam.snsCsxClk;
    #else
        snsClkVal = (uint32)curRamWdgtBasePtr->snsClk;
    #endif /* (0u != `$INSTANCE_NAME`_CSX_COMMON_TX_CLK_EN) */

    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SEQ_NORM_CNT_PTR, (uint32)curRamWdgtBasePtr->resolution);
    `$INSTANCE_NAME`_csxScanPeriod  = `$INSTANCE_NAME`_SsCalcCsxScanPeriod(curRamWdgtBasePtr);

    tmpRegVal = (uint32)curRamWdgtBasePtr->snsClkSource;

    snsClkVal = (snsClkVal - 1uL) & `$INSTANCE_NAME`_CSD_SENSE_PERIOD_SENSE_DIV_MSK;
    tmpRegVal = (tmpRegVal << `$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_SIZE_POS) | snsClkVal |
        `$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_BITS_MSK;
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SENSE_PERIOD_PTR, tmpRegVal);

    `$INSTANCE_NAME`_ModClk_SetDivider((uint32)`$INSTANCE_NAME`_dsRam.modCsxClk - 1uL);
}

/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSXSetupWidgetExt
****************************************************************************//**
*
* \brief
*  Performs extended initialization for the CSX widget and also performs
*  initialization required for a specific sensor in the widget. This function
*  requires using the `$INSTANCE_NAME`_CSXScan() function to initiate a scan.
*
* \details
*  This function does the same tasks as `$INSTANCE_NAME`_CSXSetupWidget() and
*  also connects a sensor in the widget for scanning. Once this function is
*  called to initialize a widget and a sensor, the `$INSTANCE_NAME`_CSXScanExt()
*  function must be called to scan the sensor.
*
*  This function is called when no scanning is in progress. I.e.
*  `$INSTANCE_NAME`_IsBusy() returns a non-busy status.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time or pipeline scanning for example).
*
* \param widgetId
*  Specifies the ID number of the widget to perform hardware and firmware
*  initialization required for scanning a specific sensor in a specific widget.
*  A macro for the widget ID can be found in the `$INSTANCE_NAME` Configuration header
*  file defined as `$INSTANCE_NAME`_<WidgetName>_WDGT_ID.
*
* \param sensorId
*  Specifies the ID number of the sensor within the widget to perform hardware
*  and firmware initialization required for scanning a specific sensor in a
*  specific widget.
*  A macro for the sensor ID within a specified widget can be found in the
*  `$INSTANCE_NAME` Configuration header file defined as
*  `$INSTANCE_NAME`_<WidgetName>_SNS<SensorNumber>_ID.
*
*******************************************************************************/

void `$INSTANCE_NAME`_CSXSetupWidgetExt(uint32 widgetId, uint32 sensorId)
{
    uint32 txIndex;
    uint32 rxIndex;

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_GANGED_SNS_EN)
        uint16 numElectrodes;
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_GANGED_SNS_EN) */

    /*  Initialize widget   */
    `$INSTANCE_NAME`_CSXSetupWidget(widgetId);
    `$INSTANCE_NAME`_sensorIndex = (uint8)sensorId;

    /*  Initialise sensor data structure pointer to appropriate address */
    `$INSTANCE_NAME`_curRamSnsPtr = `$INSTANCE_NAME`_curFlashWdgtPtr->ptr2SnsRam;
    `$INSTANCE_NAME`_curRamSnsPtr = &`$INSTANCE_NAME`_curRamSnsPtr[sensorId];

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
        if (0 != `$INSTANCE_NAME`_curRamSnsPtr->subConvNum)
        {
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */

    /*  Find Tx and Rx index for given snsIndex
        rxIndex = sensorId / TxCount
        txIndex = sensorId % TxCount    */
    rxIndex = sensorId /`$INSTANCE_NAME`_curFlashWdgtPtr->numRows;
    txIndex = sensorId % `$INSTANCE_NAME`_curFlashWdgtPtr->numRows;

    /*  If widget is APA, find node (Tx/Rx) to be connected for scanning    */
    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_GANGED_SNS_EN)
        if (`$INSTANCE_NAME`_GANGED_SNS_MASK == (`$INSTANCE_NAME`_curFlashWdgtPtr->staticConfig & `$INSTANCE_NAME`_GANGED_SNS_MASK))
        {
            /*  1. Get access to Rx sensor pointer  (Rx = Base + rxIndex).
                2. Get number of Rx electrodes
                3. Get Rx pointer
                4. Connect all Rx   */
            `$INSTANCE_NAME`_curGangRxPtr = `$INSTANCE_NAME`_curFlashWdgtPtr->ptr2SnsFlash;
            `$INSTANCE_NAME`_curGangRxPtr += rxIndex;
            numElectrodes = `$INSTANCE_NAME`_curGangRxPtr->numPins ;
            `$INSTANCE_NAME`_curRxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangRxPtr->firstPinId];

            do
            {
                `$INSTANCE_NAME`_CSXConnectRx(`$INSTANCE_NAME`_curRxIOPtr++);
                numElectrodes--;
            } while (0u != numElectrodes);

            /*  1. Get access to Tx sensor pointer (Tx = Base + NumberRx + TxIndex).
                2. Get number of Tx electrodes
                3. Get Tx pointer
                4. Connect all Tx   */
            `$INSTANCE_NAME`_curGangTxPtr = `$INSTANCE_NAME`_curFlashWdgtPtr->ptr2SnsFlash;
            `$INSTANCE_NAME`_curGangTxPtr += (`$INSTANCE_NAME`_curFlashWdgtPtr->numCols + txIndex);

            numElectrodes = `$INSTANCE_NAME`_curGangTxPtr->numPins ;
            `$INSTANCE_NAME`_curTxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangTxPtr->firstPinId];

            do
            {
                `$INSTANCE_NAME`_CSXConnectTx(`$INSTANCE_NAME`_curTxIOPtr++);
                numElectrodes--;
            }while (0u != numElectrodes);

            /*  Set callback to scan connected ganged sensor only */
            `$INSTANCE_NAME`_CSXPostScanApiPtr = &`$INSTANCE_NAME`_SsCSXPostSingleScan;
        }
        else
    #endif  /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_CSX_EN) */
        {
            /*  If no ganged sensor in component OR current widget no contains ganged sns, then:
                1. Find Rx pointer: Rx = Base address + RxIndex
                2. Find Tx pointer: Tx = Base address + (total Rx + TxIndex) */
            `$INSTANCE_NAME`_curRxIOPtr = (`$INSTANCE_NAME`_FLASH_IO_STRUCT const *)`$INSTANCE_NAME`_curFlashWdgtPtr->ptr2SnsFlash;
            `$INSTANCE_NAME`_curRxIOPtr = &`$INSTANCE_NAME`_curRxIOPtr[rxIndex];

