BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.c
            `$INSTANCE_NAME`_curTxIOPtr = (`$INSTANCE_NAME`_FLASH_IO_STRUCT const *)`$INSTANCE_NAME`_curFlashWdgtPtr->ptr2SnsFlash;
            `$INSTANCE_NAME`_curTxIOPtr = &`$INSTANCE_NAME`_curTxIOPtr[(`$INSTANCE_NAME`_curFlashWdgtPtr->numCols + txIndex)];

            /*  Connect Tx and Rx IOs for scan ad set flag to indicate that IOs should be disconnected   */
            `$INSTANCE_NAME`_CSXConnectTx(`$INSTANCE_NAME`_curTxIOPtr);
            `$INSTANCE_NAME`_CSXConnectRx(`$INSTANCE_NAME`_curRxIOPtr);
            `$INSTANCE_NAME`_eleCsxDisconnectFlag = `$INSTANCE_NAME`_DISCONNECT_IO_FLAG;

            /*   Set callback to scan all sensors in widget */
            `$INSTANCE_NAME`_CSXPostScanApiPtr = &`$INSTANCE_NAME`_SsCSXPostSingleScan;
        }
    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
        }
    #endif
}

/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSXScan
****************************************************************************//**
*
* \brief
*  This function initiates a scan for the sensors of the widget initialized by
*  the `$INSTANCE_NAME`_CSXSetupWidget() function.
*
* \details
*  This function performs scanning of all the sensors in the widget configured by
*  the `$INSTANCE_NAME`_CSXSetupWidget() function. It does the following tasks:
*    1. Connects the first sensor of the widget.
*    2. Initializes an interrupt callback function to initialize a scan of the
*       next sensors in a widget.
*    3. Starts scanning for the first sensor in the widget.
*
*  This function is called by the `$INSTANCE_NAME`_Scan() API if the given
*  widget uses the CSX sensing method.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time or pipeline scanning for example).
*
*  This function is called when no scanning is in progress. I.e.
*  `$INSTANCE_NAME`_IsBusy() returns a non-busy status. The widget must be
*  preconfigured by the `$INSTANCE_NAME`_CSXSetupWidget() function if any other
*  widget was previously scanned or any other type of scan functions were used.
*
*******************************************************************************/

void `$INSTANCE_NAME`_CSXScan(void)
{
    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_GANGED_SNS_EN)
        uint32 numElectrodes;
    #endif
    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
        uint32 snsIndex = 0;
        uint32 snsNum;
    #endif

    `$INSTANCE_NAME`_sensorIndex = 0u;

    /*  Initialise pointer to access sensor RAM elements    */
    `$INSTANCE_NAME`_curRamSnsPtr = `$INSTANCE_NAME`_curFlashWdgtPtr->ptr2SnsRam;

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
        /* Loop through the sensors until non-skipped is found */
        snsNum = `$INSTANCE_NAME`_curFlashWdgtPtr->totalNumSns;
        while ((snsIndex < snsNum) && (`$INSTANCE_NAME`_curRamSnsPtr->subConvNum == 0))
        {
            /*  Increment sensor pointers */
            `$INSTANCE_NAME`_curRamSnsPtr++;
            `$INSTANCE_NAME`_sensorIndex++;
            snsIndex++;
        }
        /*  Calculate total sensor to be scanned. If buttons, one Tx and an Rx for each sensor
            if Matrix button or Touchpad, M x N rule applies    */
        `$INSTANCE_NAME`_curWdgtTotalTx = `$INSTANCE_NAME`_curFlashWdgtPtr->numRows - snsIndex % `$INSTANCE_NAME`_curFlashWdgtPtr->numRows;
        `$INSTANCE_NAME`_curWdgtTotalRx  = `$INSTANCE_NAME`_curFlashWdgtPtr->numCols - snsIndex / `$INSTANCE_NAME`_curFlashWdgtPtr->numRows;

        /* Scan sensor if it's index within a valid range otherwise do nothing as all sensors are skipped */
        if (snsIndex < snsNum)
        {
            #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_GANGED_SNS_EN)
                if ((`$INSTANCE_NAME`_curFlashWdgtPtr->staticConfig & `$INSTANCE_NAME`_GANGED_SNS_MASK) != 0u)
                {
                    /* Connect all Rx electrodes */
                    `$INSTANCE_NAME`_curGangRxPtr = `$INSTANCE_NAME`_curFlashWdgtPtr->ptr2SnsFlash;
                    `$INSTANCE_NAME`_curGangRxPtr += snsIndex /`$INSTANCE_NAME`_curFlashWdgtPtr->numRows;
                    numElectrodes = `$INSTANCE_NAME`_curGangRxPtr->numPins;
                    `$INSTANCE_NAME`_curRxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangRxPtr->firstPinId];
                    do
                    {
                        `$INSTANCE_NAME`_CSXConnectRx(`$INSTANCE_NAME`_curRxIOPtr++);
                        numElectrodes--;
                    } while (0u != numElectrodes);

                    /* Connect all Tx electrodes */
                    `$INSTANCE_NAME`_curGangTxPtr = `$INSTANCE_NAME`_curFlashWdgtPtr->ptr2SnsFlash;
                    `$INSTANCE_NAME`_curGangTxPtr += (`$INSTANCE_NAME`_curFlashWdgtPtr->numCols + snsIndex % `$INSTANCE_NAME`_curFlashWdgtPtr->numRows);
                    numElectrodes = `$INSTANCE_NAME`_curGangTxPtr->numPins;
                    `$INSTANCE_NAME`_curTxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangTxPtr->firstPinId];
                    do
                    {
                        `$INSTANCE_NAME`_CSXConnectTx(`$INSTANCE_NAME`_curTxIOPtr++);
                        numElectrodes--;
                    }while (0u != numElectrodes);
                    /*  Assign callback to ISR  */
                    `$INSTANCE_NAME`_CSXPostScanApiPtr = &`$INSTANCE_NAME`_SsCSXPostMultiScanGanged;
                }
                else
            #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_GANGED_SNS_EN) */
            {
                /* Find Rx pointer: Rx = Base_address + SnsIndex / total_Tx */
                `$INSTANCE_NAME`_curRxIOPtr = (`$INSTANCE_NAME`_FLASH_IO_STRUCT const *)`$INSTANCE_NAME`_curFlashWdgtPtr->ptr2SnsFlash;
                `$INSTANCE_NAME`_curRxIOPtr += (snsIndex / `$INSTANCE_NAME`_curFlashWdgtPtr->numRows);
                /* Find Tx pointer: Tx = Base_address + total_Rx + SnsIndex % total_Tx */
                `$INSTANCE_NAME`_curTxIOPtr = (`$INSTANCE_NAME`_FLASH_IO_STRUCT const *)`$INSTANCE_NAME`_curFlashWdgtPtr->ptr2SnsFlash;
                `$INSTANCE_NAME`_curTxIOPtr += `$INSTANCE_NAME`_curFlashWdgtPtr->numCols;
                `$INSTANCE_NAME`_curTxIOPtr += (snsIndex % `$INSTANCE_NAME`_curFlashWdgtPtr->numRows);
                /* Connect Tx and Rx electrodes for scan */
                `$INSTANCE_NAME`_CSXConnectTx(`$INSTANCE_NAME`_curTxIOPtr);
                `$INSTANCE_NAME`_CSXConnectRx(`$INSTANCE_NAME`_curRxIOPtr);
                /* Set callback to scan all sensors in widget */
                `$INSTANCE_NAME`_CSXPostScanApiPtr = &`$INSTANCE_NAME`_SsCSXPostMultiScan;
            }

            /*  If frequency hopping is enabled, reset hopping channel counter  */
            #if (`$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN == `$INSTANCE_NAME`_ENABLE)
                `$INSTANCE_NAME`_scanFreqIndex = 0u;
            #endif

            /*  Set scan status, enter critical section and initiate scan   */
            `$INSTANCE_NAME`_dsRam.status |= `$INSTANCE_NAME`_SW_STS_BUSY;
            `$INSTANCE_NAME`_SsCSXStartSample();
        }

