BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.c
    #else /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */

        /*  Calculate total sensor to be scanned. If buttons, one Tx and an Rx for each sensor
            if Matrix button or Touchpad, M x N rule applies    */
        `$INSTANCE_NAME`_curWdgtTotalTx = `$INSTANCE_NAME`_curFlashWdgtPtr->numRows;
        `$INSTANCE_NAME`_curWdgtTotalRx  = `$INSTANCE_NAME`_curFlashWdgtPtr->numCols;

        /*  If component contains CSX ganged sensor, then check if widget contains ganged sensor.   */
        #if (`$INSTANCE_NAME`_CSX_GANGED_SNS_EN == 1u)
            if ((`$INSTANCE_NAME`_curFlashWdgtPtr->staticConfig & `$INSTANCE_NAME`_GANGED_SNS_MASK) != 0u)
            {
                /*  1. Get sns pointer for first Rx
                    2. Get number of Rx pin
                    3. Get pointer to the Rx pin
                    4. Connect all Rx pins   */
                `$INSTANCE_NAME`_curGangRxPtr = `$INSTANCE_NAME`_curFlashWdgtPtr->ptr2SnsFlash;
                numElectrodes = `$INSTANCE_NAME`_curGangRxPtr->numPins ;
                `$INSTANCE_NAME`_curRxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangRxPtr->firstPinId];
                do
                {
                    `$INSTANCE_NAME`_CSXConnectRx(`$INSTANCE_NAME`_curRxIOPtr++);
                    numElectrodes--;
                } while (0u != numElectrodes);

                /*  1. Get sns pointer for first Tx (Tx = Base + number of Rx).
                    2. Get number of Tx electrodes
                    3. Get pointer the Tx electrode
                    4. Connect all Tx   */
                `$INSTANCE_NAME`_curGangTxPtr = `$INSTANCE_NAME`_curFlashWdgtPtr->ptr2SnsFlash;
                `$INSTANCE_NAME`_curGangTxPtr += `$INSTANCE_NAME`_curFlashWdgtPtr->numCols;
                numElectrodes = `$INSTANCE_NAME`_curGangTxPtr->numPins ;
                `$INSTANCE_NAME`_curTxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangTxPtr->firstPinId];

                do
                {
                    `$INSTANCE_NAME`_CSXConnectTx(`$INSTANCE_NAME`_curTxIOPtr++);
                    numElectrodes--;
                }while (0u != numElectrodes);

                /*  Assign callback to ISR  */
                `$INSTANCE_NAME`_CSXPostScanApiPtr = &`$INSTANCE_NAME`_SsCSXPostMultiScanGanged;

            }
            else
        #endif
            {
                /*  If no ganged sensor in the component OR current widget contains no ganged sns, then:
                    1. Find Rx pointer: Rx = Base address.
                    2. Find Tx pointer: Tx = Base address + total Rx */
                `$INSTANCE_NAME`_curRxIOPtr = (`$INSTANCE_NAME`_FLASH_IO_STRUCT const *)`$INSTANCE_NAME`_curFlashWdgtPtr->ptr2SnsFlash;
                `$INSTANCE_NAME`_curTxIOPtr = `$INSTANCE_NAME`_curRxIOPtr;
                `$INSTANCE_NAME`_curTxIOPtr = &`$INSTANCE_NAME`_curTxIOPtr[(`$INSTANCE_NAME`_curFlashWdgtPtr->numCols)];

                /*  Connect first Tx and first Rx IOs for scan  */
                `$INSTANCE_NAME`_CSXConnectTx(`$INSTANCE_NAME`_curTxIOPtr);
                `$INSTANCE_NAME`_CSXConnectRx(`$INSTANCE_NAME`_curRxIOPtr);

                /*   Set callback to scan all sensors in widget */
                `$INSTANCE_NAME`_CSXPostScanApiPtr = &`$INSTANCE_NAME`_SsCSXPostMultiScan;
            }

            /*  If frequency hopping is enabled, reset hopping channel counter  */
            #if (`$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN == `$INSTANCE_NAME`_ENABLE)
                `$INSTANCE_NAME`_scanFreqIndex = 0u;
            #endif

        /*  Set scan status, enter critical section and initiate scan   */
        `$INSTANCE_NAME`_dsRam.status |= `$INSTANCE_NAME`_SW_STS_BUSY;
        `$INSTANCE_NAME`_SsCSXStartSample();

    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */
}

/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSXScanExt()
****************************************************************************//**
*
* \brief
*  Starts the CSX conversion on the preconfigured sensor. This function requires
*  using the `$INSTANCE_NAME`_CSXSetupWidgetExt() function to set up a
*  widget.
*
* \details
*  This function performs single scanning of one sensor in the widget configured
*  by the `$INSTANCE_NAME`_CSXSetupWidgetExt() function. It does the following
*  tasks:
*    1. Sets a busy flag in the `$INSTANCE_NAME`_dsRam structure.
*    2. Configures the Tx clock frequency.
*    3. Configures the Modulator clock frequency.
*    4. Configures the IDAC value.
*    5. Starts single scanning.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time or pipeline scanning for example). This
*  function is called when no scanning is in progress. I.e.
*  `$INSTANCE_NAME`_IsBusy() returns a non-busy status.
*
*  The sensor must be preconfigured by using the
*  `$INSTANCE_NAME`_CSXSetupWidgetExt() API prior to calling this function.
*  The sensor remains ready for the next scan if a previous scan was triggered
*  by using the `$INSTANCE_NAME`_CSXScanExt() function. In this case, calling
*  `$INSTANCE_NAME`_CSXSetupWidgetExt() is not required every time before the
*  `$INSTANCE_NAME`_CSXScanExt() function. If a previous scan was triggered in
*  any other way - `$INSTANCE_NAME`_Scan(), `$INSTANCE_NAME`_ScanAllWidgets()
*  or `$INSTANCE_NAME`_RunTuner() - (see the `$INSTANCE_NAME`_RunTuner() function
*  description for more details), the sensor must be preconfigured again by
*  using the `$INSTANCE_NAME`_CSXSetupWidgetExt() API prior to calling the
*  `$INSTANCE_NAME`_CSXScanExt() function.
*
*  If disconnection of the sensors is required after calling
*  `$INSTANCE_NAME`_CSXScanExt(), the `$INSTANCE_NAME`_CSXDisconnectTx() and
*  `$INSTANCE_NAME`_CSXDisconnectRx() APIs can be used.
*
*******************************************************************************/

void `$INSTANCE_NAME`_CSXScanExt(void)
{
    /*  If frequency hopping is enabled, reset hopping channel counter  */
    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
        `$INSTANCE_NAME`_scanFreqIndex = 0u;
    #endif

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
        if (0 != `$INSTANCE_NAME`_curRamSnsPtr->subConvNum)
        {
            /*  Set busy flag and start conversion  */
            `$INSTANCE_NAME`_dsRam.status |= `$INSTANCE_NAME`_SW_STS_BUSY;
            `$INSTANCE_NAME`_SsCSXStartSample();
        }
    #else
        /*  Set busy flag and start conversion  */
        `$INSTANCE_NAME`_dsRam.status |= `$INSTANCE_NAME`_SW_STS_BUSY;
        `$INSTANCE_NAME`_SsCSXStartSample();
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */
}


