BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.c
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCSXPostMultiScan
****************************************************************************//**
*
* \brief
*   ISR function implements the multiple-sensor scanning for un-ganged CSX widgets.
*   This function is called by the component ISR only, it should not be used by
*   the application layer.
*
*******************************************************************************/

static void `$INSTANCE_NAME`_SsCSXPostMultiScan(void)
{
    #ifdef `$INSTANCE_NAME`_ENTRY_CALLBACK
        `$INSTANCE_NAME`_EntryCallback();
    #endif /* `$INSTANCE_NAME`_ENTRY_CALLBACK */

    /*  Copy scan result into sensor raw count array    */
    `$INSTANCE_NAME`_curRamSnsPtr->raw[`$INSTANCE_NAME`_scanFreqIndex] = \
                             (`$INSTANCE_NAME`_csxScanPeriod - `$INSTANCE_NAME`_csxRawCount);

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
    /*  Increment frequency hopping index and imitate next scan if all channels
        are not scanned */
        `$INSTANCE_NAME`_scanFreqIndex++;
        if (`$INSTANCE_NAME`_scanFreqIndex < 3u)
        {
            /*  Change IMO frequency and start sample   */
                `$INSTANCE_NAME`_SsChangeClkFreq((uint32)`$INSTANCE_NAME`_scanFreqIndex);
                `$INSTANCE_NAME`_SsCSXStartSample();
        }
        else
    #endif
        {
            /*  Restore IMO clock, Reset frequency hopping channel counter, if FH is enabled.   */
            #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
                `$INSTANCE_NAME`_SsChangeClkFreq(0u);
                `$INSTANCE_NAME`_scanFreqIndex = 0u;
            #endif

            #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
                /* Disconnect Tx/Rx electrodes of previously scanned sensor as preparation for next sensor scan */
                `$INSTANCE_NAME`_CSXDisconnectTx(`$INSTANCE_NAME`_curTxIOPtr);
                `$INSTANCE_NAME`_CSXDisconnectRx(`$INSTANCE_NAME`_curRxIOPtr);

                /* Increment sensor until non-skipped is found */
                do
                {
                    /* Increment sensor index to configure next sensor in widget */
                    `$INSTANCE_NAME`_sensorIndex++;

                    /*  Increment sensor pointers */
                    `$INSTANCE_NAME`_curRamSnsPtr++;
                    `$INSTANCE_NAME`_curWdgtTotalTx--;
                    if (`$INSTANCE_NAME`_curWdgtTotalTx > 0u)
                    {
                        `$INSTANCE_NAME`_curTxIOPtr++;
                    }
                    else
                    {
                        `$INSTANCE_NAME`_curWdgtTotalRx--;
                        if (`$INSTANCE_NAME`_curWdgtTotalRx > 0u)
                        {
                            `$INSTANCE_NAME`_curRxIOPtr++;
                            `$INSTANCE_NAME`_curWdgtTotalTx  = `$INSTANCE_NAME`_curFlashWdgtPtr->numRows;
                            `$INSTANCE_NAME`_curTxIOPtr = (`$INSTANCE_NAME`_FLASH_IO_STRUCT const *)`$INSTANCE_NAME`_curFlashWdgtPtr->ptr2SnsFlash;
                            `$INSTANCE_NAME`_curTxIOPtr = & `$INSTANCE_NAME`_curTxIOPtr[(`$INSTANCE_NAME`_curFlashWdgtPtr->numCols)];
                        }
                    }
                } while ((`$INSTANCE_NAME`_curWdgtTotalRx != 0) && (`$INSTANCE_NAME`_curRamSnsPtr->subConvNum == 0));

                /* Perform the next scan or switch to the next widget */
                if(`$INSTANCE_NAME`_curWdgtTotalRx != 0u)
                {
                    /* Connect Tx/Rx electrodes for the next scan */
                    `$INSTANCE_NAME`_CSXConnectTx(`$INSTANCE_NAME`_curTxIOPtr);
                    `$INSTANCE_NAME`_CSXConnectRx(`$INSTANCE_NAME`_curRxIOPtr);
                    /*  Reset scan result holder, and initiate scan */
                    `$INSTANCE_NAME`_SsCSXStartSample();
                }
                else
                {
                    /*  Call scan next widget API if requested, if not, complete scan   */
                    if (`$INSTANCE_NAME`_requestScanAllWidget != 0u)
                    {
                        `$INSTANCE_NAME`_SsPostAllWidgetsScan();
                    }
                    else
                    {
                        `$INSTANCE_NAME`_dsRam.scanCounter++;
                        `$INSTANCE_NAME`_dsRam.status &= ~`$INSTANCE_NAME`_SW_STS_BUSY;
                    }
                }
            #else /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */

                /*  Disconnect Tx electrodes of previously scanned sensor as
                    preparation for next sensor scan    */
                `$INSTANCE_NAME`_CSXDisconnectTx (`$INSTANCE_NAME`_curTxIOPtr);

                /* Increment sensor index to configure next sensor in widget */
                `$INSTANCE_NAME`_sensorIndex++;

                /*  Initiate scan for next sensor in widget, if all sensors in
                    widget are not scanned */
                `$INSTANCE_NAME`_curWdgtTotalTx--;
                if (`$INSTANCE_NAME`_curWdgtTotalTx > 0u)
                {
                    /*  1. Increment pointer to next Tx
                        2. Connect next Rx for scan
                        3. Increment pointer to sns data    */
                    `$INSTANCE_NAME`_curTxIOPtr++;
                    `$INSTANCE_NAME`_CSXConnectTx (`$INSTANCE_NAME`_curTxIOPtr);
                    `$INSTANCE_NAME`_curRamSnsPtr++;

                    /*  Reset scan result holder, and initiate scan */
                    `$INSTANCE_NAME`_SsCSXStartSample();
                }

                /*  Check if all Rx are looped through  */
                else
                {
                    `$INSTANCE_NAME`_curWdgtTotalRx--;
                    if (`$INSTANCE_NAME`_curWdgtTotalRx > 0u)
                    {
                        /*  1. Disconnect current Rx electrode
                            2. Connect next Rx electrode
                            3. Re-initialize total Tx to be scanned per Rx
                            4. Find first Tx electrode again
                            5. Connect first Tx electrode   */
                        `$INSTANCE_NAME`_CSXDisconnectRx(`$INSTANCE_NAME`_curRxIOPtr);
                        `$INSTANCE_NAME`_curRxIOPtr++;
                        `$INSTANCE_NAME`_CSXConnectRx(`$INSTANCE_NAME`_curRxIOPtr);
                        `$INSTANCE_NAME`_curWdgtTotalTx  = `$INSTANCE_NAME`_curFlashWdgtPtr->numRows;
                        `$INSTANCE_NAME`_curTxIOPtr = (`$INSTANCE_NAME`_FLASH_IO_STRUCT const *)`$INSTANCE_NAME`_curFlashWdgtPtr->ptr2SnsFlash;
                        `$INSTANCE_NAME`_curTxIOPtr = & `$INSTANCE_NAME`_curTxIOPtr[(`$INSTANCE_NAME`_curFlashWdgtPtr->numCols)];
                        `$INSTANCE_NAME`_CSXConnectTx(`$INSTANCE_NAME`_curTxIOPtr);

                        /*  Increment RAM sensor pointer pointer    */
                        `$INSTANCE_NAME`_curRamSnsPtr++;

                        /*  Initiate sample */
                        `$INSTANCE_NAME`_SsCSXStartSample();
                    }
                    else
                    {
                        /*  If all sensors are scanned, disconnect Tx   */
                        `$INSTANCE_NAME`_CSXDisconnectRx(`$INSTANCE_NAME`_curRxIOPtr);

                        /*  Call scan next widget API if requested, if not, complete scan   */
                        if (`$INSTANCE_NAME`_requestScanAllWidget != 0u)
                        {
                            `$INSTANCE_NAME`_SsPostAllWidgetsScan();
                        }
                        else
                        {
                            /* All pending scans completed,
                                1. update the counter to indicat same
                                2. Clear busy state as scanning is completed      */
                            `$INSTANCE_NAME`_dsRam.scanCounter++;
                            `$INSTANCE_NAME`_dsRam.status &= ~`$INSTANCE_NAME`_SW_STS_BUSY;
                        }
                    }
                }
            #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */
        }

    #ifdef `$INSTANCE_NAME`_EXIT_CALLBACK
        `$INSTANCE_NAME`_ExitCallback();
    #endif /* `$INSTANCE_NAME`_EXIT_CALLBACK */
}


