BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.c
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCSXPostMultiScanGanged
****************************************************************************//**
*
* \brief
*   The ISR function implements the multiple-sensor scanning for ganged CSX widgets.
*   This function is called by the Component ISR only, should not be used by
*   the application layer.
*
* \details
*   The ISR function implements the multiple-sensor scanning for ganged CSX widgets.
*   This function is called by the Component ISR only, should not be used by
*   the application layer.
*
*******************************************************************************/
#if (`$INSTANCE_NAME`_CSX_GANGED_SNS_EN == 1u)

static void `$INSTANCE_NAME`_SsCSXPostMultiScanGanged(void)
{
    uint32 numElectrodes;

    #ifdef `$INSTANCE_NAME`_ENTRY_CALLBACK
        `$INSTANCE_NAME`_EntryCallback();
    #endif /* `$INSTANCE_NAME`_ENTRY_CALLBACK */

    /*  Copy scan result into sensor raw count array    */
    `$INSTANCE_NAME`_curRamSnsPtr->raw[`$INSTANCE_NAME`_scanFreqIndex] = \
                    (`$INSTANCE_NAME`_csxScanPeriod - `$INSTANCE_NAME`_csxRawCount);

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
    /*  Increment frequency hopping index and initiate next scan if all channels are not scanned */
        `$INSTANCE_NAME`_scanFreqIndex++;
        if (`$INSTANCE_NAME`_scanFreqIndex < 3u)
        {
            /*  Change IMO frequency and start sample   */
            `$INSTANCE_NAME`_SsChangeClkFreq (`$INSTANCE_NAME`_scanFreqIndex);
            `$INSTANCE_NAME`_SsCSXStartSample();
        }
        else
    #endif
        {
            /*  Restore IMO clock, Reset frequency hopping channel counter, if FH is enabled.   */
            #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
                `$INSTANCE_NAME`_SsChangeClkFreq (0u);
                `$INSTANCE_NAME`_scanFreqIndex = 0u;
            #endif

            #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
                /* Disconnect Tx electrodes of previously scanned sensor as preparation for next sensor scan */
                numElectrodes = `$INSTANCE_NAME`_curGangTxPtr->numPins;
                `$INSTANCE_NAME`_curTxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangTxPtr->firstPinId];
                do
                {
                    `$INSTANCE_NAME`_CSXDisconnectTx(`$INSTANCE_NAME`_curTxIOPtr++);
                    numElectrodes--;
                } while (0u != numElectrodes);
                /* Disconnect Rx electrodes of previously scanned sensor as preparation for next sensor scan */
                numElectrodes = `$INSTANCE_NAME`_curGangRxPtr->numPins;
                `$INSTANCE_NAME`_curRxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangRxPtr->firstPinId];
                do
                {
                    `$INSTANCE_NAME`_CSXDisconnectRx(`$INSTANCE_NAME`_curRxIOPtr++);
                    numElectrodes--;
                } while (0u != numElectrodes);

                /* Increment sensor until non-skipped is found */
                do
                {
                    /* Increment sensor index to configure next sensor in widget */
                    `$INSTANCE_NAME`_sensorIndex++;

                    /*  Increment RAM sensor pointer */
                    `$INSTANCE_NAME`_curRamSnsPtr++;
                    `$INSTANCE_NAME`_curWdgtTotalTx--;
                    if (`$INSTANCE_NAME`_curWdgtTotalTx > 0u)
                    {
                        `$INSTANCE_NAME`_curGangTxPtr++;
                    }
                    else
                    {
                        /*  Check if all Rx are scanned, if not, initiate scan for next Rx  */
                        `$INSTANCE_NAME`_curWdgtTotalRx--;
                        if (`$INSTANCE_NAME`_curWdgtTotalRx > 0u)
                        {
                            `$INSTANCE_NAME`_curGangRxPtr++;
                            `$INSTANCE_NAME`_curWdgtTotalTx = `$INSTANCE_NAME`_curFlashWdgtPtr->numRows;
                            `$INSTANCE_NAME`_curGangTxPtr = `$INSTANCE_NAME`_curFlashWdgtPtr->ptr2SnsFlash;
                            `$INSTANCE_NAME`_curGangTxPtr += `$INSTANCE_NAME`_curFlashWdgtPtr->numCols;
                        }
                    }
                } while ((`$INSTANCE_NAME`_curWdgtTotalRx != 0) && (`$INSTANCE_NAME`_curRamSnsPtr->subConvNum == 0));

                if(`$INSTANCE_NAME`_curWdgtTotalRx != 0u)
                {
                    /* Connect Tx electrodes for the next scan */
                    numElectrodes = `$INSTANCE_NAME`_curGangTxPtr->numPins;
                    `$INSTANCE_NAME`_curTxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangTxPtr->firstPinId];
                    do
                    {
                        `$INSTANCE_NAME`_CSXConnectTx(`$INSTANCE_NAME`_curTxIOPtr++);
                        numElectrodes--;
                    } while (0u != numElectrodes);
                    /* Connect Tx electrodes for the next scan */
                    numElectrodes = `$INSTANCE_NAME`_curGangRxPtr->numPins ;
                    `$INSTANCE_NAME`_curRxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangRxPtr->firstPinId];
                    do
                    {
                        `$INSTANCE_NAME`_CSXConnectRx(`$INSTANCE_NAME`_curRxIOPtr++);
                        numElectrodes--;
                    } while (0u != numElectrodes);
                    /*  Reset scan result holder, and initiate scan */
                    `$INSTANCE_NAME`_SsCSXStartSample();
                }
                else
                {
                    /*  Call scan next widget API if requested, if not, complete scan   */
                    if (`$INSTANCE_NAME`_requestScanAllWidget != 0u)
                    {
                        `$INSTANCE_NAME`_SsPostAllWidgetsScan();
                    }
                    else
                    {
                        `$INSTANCE_NAME`_dsRam.scanCounter++;
                        `$INSTANCE_NAME`_dsRam.status &= ~`$INSTANCE_NAME`_SW_STS_BUSY;
                    }
                }
            #else /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */

                /*  Disconnect ALL pins of previously scanned Tx     */
                numElectrodes = `$INSTANCE_NAME`_curGangTxPtr->numPins ;
                `$INSTANCE_NAME`_curTxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangTxPtr->firstPinId];
                do
                {
                    `$INSTANCE_NAME`_CSXDisconnectTx (`$INSTANCE_NAME`_curTxIOPtr++);
                    numElectrodes--;
                } while (0u != numElectrodes);

