BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.c
                /* Increment sensor index to configure next sensor in widget */
                `$INSTANCE_NAME`_sensorIndex++;

                /*  Check if all Tx are scanned, if not, initiate scan for next Tx  */
                `$INSTANCE_NAME`_curWdgtTotalTx--;
                if (`$INSTANCE_NAME`_curWdgtTotalTx > 0u)
                {
                    /*  1. Find pointer of next Tx (ganged)
                        2. Connect all Tx pins        */
                    `$INSTANCE_NAME`_curGangTxPtr++;
                    numElectrodes = `$INSTANCE_NAME`_curGangTxPtr->numPins ;
                    `$INSTANCE_NAME`_curTxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangTxPtr->firstPinId];
                    do
                    {
                        `$INSTANCE_NAME`_CSXConnectTx(`$INSTANCE_NAME`_curTxIOPtr++);
                        numElectrodes--;
                    } while (0u != numElectrodes);

                    /*  Increment RAM pointer to next sensor    */
                    `$INSTANCE_NAME`_curRamSnsPtr++;

                    /*  Reset scan result holder and initiate scan */
                    `$INSTANCE_NAME`_SsCSXStartSample();
                }
                else
                {
                    /*  Check if all Rx are scanned, if not, initiate scan for next Rx  */
                    `$INSTANCE_NAME`_curWdgtTotalRx--;
                    if (`$INSTANCE_NAME`_curWdgtTotalRx > 0u)
                    {
                        /*  1. Disconnect current Rx ALL pins   */
                        numElectrodes = `$INSTANCE_NAME`_curGangRxPtr->numPins ;
                        `$INSTANCE_NAME`_curRxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangRxPtr->firstPinId];
                        do
                        {
                            `$INSTANCE_NAME`_CSXDisconnectRx(`$INSTANCE_NAME`_curRxIOPtr++);
                            numElectrodes--;
                        } while (0u != numElectrodes);

                        /*  2. Connect next Rx ALL pins */
                        `$INSTANCE_NAME`_curGangRxPtr++;
                        numElectrodes = `$INSTANCE_NAME`_curGangRxPtr->numPins ;
                        `$INSTANCE_NAME`_curRxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangRxPtr->firstPinId];
                        do
                        {
                            `$INSTANCE_NAME`_CSXConnectRx(`$INSTANCE_NAME`_curRxIOPtr++);
                            numElectrodes--;
                        } while (0u != numElectrodes);

                        /*
                        *   3. Re-initialize total Tx to be scanned per Rx
                        *   4. Find first Tx  again
                        *   5. Connect first Tx ALL pins
                        */
                        `$INSTANCE_NAME`_curWdgtTotalTx = `$INSTANCE_NAME`_curFlashWdgtPtr->numRows;
                        `$INSTANCE_NAME`_curGangTxPtr = `$INSTANCE_NAME`_curFlashWdgtPtr->ptr2SnsFlash;
                        `$INSTANCE_NAME`_curGangTxPtr += `$INSTANCE_NAME`_curFlashWdgtPtr->numCols;

                        /*  5. Connect Tx ALL pins    */
                        numElectrodes = `$INSTANCE_NAME`_curGangTxPtr->numPins ;
                        `$INSTANCE_NAME`_curTxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangTxPtr->firstPinId];
                        do
                        {
                            `$INSTANCE_NAME`_CSXConnectTx(`$INSTANCE_NAME`_curTxIOPtr++);
                            numElectrodes--;
                        } while (0u != numElectrodes);

                        /*  Increment RAM pointer to next sensor */
                        `$INSTANCE_NAME`_curRamSnsPtr++;

                        /*  Reset scan result holder and initiate scan */
                        `$INSTANCE_NAME`_SsCSXStartSample();
                    }
                    else
                    {
                        /*  Disconnect ALL electrodes of previously scanned Rx   */
                        numElectrodes = `$INSTANCE_NAME`_curGangRxPtr->numPins ;
                        `$INSTANCE_NAME`_curRxIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curGangRxPtr->firstPinId];
                        do
                        {
                            `$INSTANCE_NAME`_CSXDisconnectRx(`$INSTANCE_NAME`_curRxIOPtr++);
                            numElectrodes--;
                        } while (0u != numElectrodes);

                        /*  Call scan next widget API if requested, if not, complete scan   */
                        if (`$INSTANCE_NAME`_requestScanAllWidget != 0u)
                        {
                            `$INSTANCE_NAME`_SsPostAllWidgetsScan();
                        }
                        else
                        {
                            /* All pending scans completed,
                                1. update the counter to indicate same
                                2. Clear busy state as scanning is completed      */
                            `$INSTANCE_NAME`_dsRam.scanCounter++;
                            `$INSTANCE_NAME`_dsRam.status &= ~`$INSTANCE_NAME`_SW_STS_BUSY;
                        }
                    }
                }
            #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */
        }

    #ifdef `$INSTANCE_NAME`_EXIT_CALLBACK
        `$INSTANCE_NAME`_ExitCallback();
    #endif /* `$INSTANCE_NAME`_EXIT_CALLBACK */
}

#endif  /*  end of (`$INSTANCE_NAME`_CSX_GANGED_SNS_EN == 1u)   */

/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCSXPostSingleScan
****************************************************************************//**
*
* \brief
*   The ISR function for single-sensor scanning implementation.
*
* \details
*   This function is used by `$INSTANCE_NAME` ISR in the CSX scanning mode to implement
*   the single-sensor scanning.
*   This function should not be used by the application layer.
*
*******************************************************************************/

