BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.c
static void `$INSTANCE_NAME`_SsCSXPostSingleScan(void)
{
    #ifdef `$INSTANCE_NAME`_ENTRY_CALLBACK
        `$INSTANCE_NAME`_EntryCallback();
    #endif /* `$INSTANCE_NAME`_ENTRY_CALLBACK */

    /*
    * Copy scan result into sensor raw count array and clear busy flag
    *    No sensor is connected or disconnected in this function
    *    Calling `$INSTANCE_NAME`_ScanExt from application would perform
    *    one more scan of same sensor. Specifically for low-power mode.
    */
    `$INSTANCE_NAME`_curRamSnsPtr->raw[`$INSTANCE_NAME`_scanFreqIndex] =
                        (`$INSTANCE_NAME`_csxScanPeriod - `$INSTANCE_NAME`_csxRawCount);

    /*  If frequency hopping is enabled */
    #if (`$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN == `$INSTANCE_NAME`_ENABLE)
        /*  Increment frequency hopping index and initiate next scan if all
            channels are not scanned */
        if (++`$INSTANCE_NAME`_scanFreqIndex < 3u)
        {
            /*  Change IMO frequency and start sample   */
            `$INSTANCE_NAME`_SsChangeClkFreq((uint32)`$INSTANCE_NAME`_scanFreqIndex);
            `$INSTANCE_NAME`_SsCSXStartSample();
        }
        else
    #endif
        {
            /*  Restore IMO clock   */
            #if (`$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN == `$INSTANCE_NAME`_ENABLE)
                `$INSTANCE_NAME`_SsChangeClkFreq(0u);
            #endif

            /*
            * All pending scans completed,
            *   1. Update the counter to indicate same
            *   2. Clear busy state as scanning is completed
            */
            `$INSTANCE_NAME`_dsRam.scanCounter++;
            `$INSTANCE_NAME`_dsRam.status &= ~`$INSTANCE_NAME`_SW_STS_BUSY;
        }

    #ifdef `$INSTANCE_NAME`_EXIT_CALLBACK
        `$INSTANCE_NAME`_ExitCallback();
    #endif /* `$INSTANCE_NAME`_EXIT_CALLBACK */
}

/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSXCalibrateWidget
****************************************************************************//**
*
* \brief
*  Calibrates the raw count values of all the sensors/nodes in a CSX widget.
*
* \details
*  Performs a successive approximation search algorithm to find appropriate
*  IDAC values for sensors in the specified widget that provides a raw count
*  to the level specified by the target parameter.
*
*  This function is available when the CSX Enable IDAC auto-calibration
*  parameter is enabled.
*
* \param  widgetId
*  Specifies the ID number of the CSX widget to calibrate its raw count.
*  A macro for the widget ID can be found in the
*  `$INSTANCE_NAME` Configuration header file defined as
*  `$INSTANCE_NAME`_<WidgetName>_WDGT_ID.
*
* \param  target
*  Specifies the calibration target in percentages of the maximum raw count.
*
*******************************************************************************/
#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_IDAC_AUTOCAL_EN)

void `$INSTANCE_NAME`_CSXCalibrateWidget(uint32 widgetId, uint16 target)
{
    /* Variable to calculate raw count target */
    uint32 rawTarget;
    /* Counter for loop execution */
    uint32 totalSns;
    /* Counter for loop execution */
    uint32 calibrationIndex;

    /* Currently used IDAC-bit */
    uint8 curIdacMask = (1u << (`$INSTANCE_NAME`_CSX_IDAC_BITS_USED-1u));
    /* Next used IDAC-bit */
    uint8 nextIdacMask = (curIdacMask >> 1u);

    /*  Initialise ptr to sensor structures */
    `$INSTANCE_NAME`_curRamSnsPtr = (`$INSTANCE_NAME`_RAM_SNS_STRUCT *)`$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].ptr2SnsRam;

    #if (`$INSTANCE_NAME`_DISABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
        /*  Calculate target raw count */
        `$INSTANCE_NAME`_csxScanPeriod  = `$INSTANCE_NAME`_SsCalcCsxScanPeriod(
            (`$INSTANCE_NAME`_RAM_WD_BASE_STRUCT *)`$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].ptr2WdgtRam);
        rawTarget = `$INSTANCE_NAME`_csxScanPeriod;
        rawTarget = (rawTarget * target) / `$INSTANCE_NAME`_PERCENTAGE_100;
    #endif /* (`$INSTANCE_NAME`_DISABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */

    if (`$INSTANCE_NAME`_SENSE_METHOD_CSX_E ==
       `$INSTANCE_NAME`_GET_SENSE_METHOD(&`$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId]))
    {
        /*  Find out total sensors/nodes in widget  */
        totalSns = ((uint32)`$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].numCols *
                    (uint32)`$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].numRows);

        /*  Clear raw count registers and IDAC registers of all sensors/nodes   */
        for (calibrationIndex = 0u; calibrationIndex < totalSns; calibrationIndex++)
        {
            `$INSTANCE_NAME`_curRamSnsPtr->raw[0u] = 0u;
            `$INSTANCE_NAME`_curRamSnsPtr->idacComp[0u] = curIdacMask;
            #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
                `$INSTANCE_NAME`_curRamSnsPtr->raw[1] = 0u;
                `$INSTANCE_NAME`_curRamSnsPtr->raw[2] = 0u;
                `$INSTANCE_NAME`_curRamSnsPtr->idacComp[1] = curIdacMask;
                `$INSTANCE_NAME`_curRamSnsPtr->idacComp[2] = curIdacMask;
            #endif
            `$INSTANCE_NAME`_curRamSnsPtr++;
        }

        /*  1. Perform binary search for accurate IDAC value for each sensor/node   */
        do
        {
            /*  Scan all sensors/nodes in widget    */
            (void)`$INSTANCE_NAME`_SetupWidget(widgetId);
            (void)`$INSTANCE_NAME`_Scan();

            while ((*(volatile uint8 *)&`$INSTANCE_NAME`_dsRam.status & `$INSTANCE_NAME`_SW_STS_BUSY) != 0u)
            {
            }

            /*  1. Get access to sensor data    */
            `$INSTANCE_NAME`_curRamSnsPtr = (`$INSTANCE_NAME`_RAM_SNS_STRUCT *)`$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].ptr2SnsRam;

            /*  1.2 Check raw count and adjust IDAC, loop through all sensors/nodes */
            for (calibrationIndex = 0u; calibrationIndex < totalSns; calibrationIndex++)
            {
                /*  1.2.0 Calculate raw count target for specified node */
                #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
                    rawTarget = (`$INSTANCE_NAME`_SsCSXOversample() * target) / `$INSTANCE_NAME`_PERCENTAGE_100;
                #endif

                /*  1.2.1 Check if current raw count is above target,
                        if yes, clear the MS bit of bit
                        if no, keep the MS bit and set next bit     */
                if (`$INSTANCE_NAME`_curRamSnsPtr->raw[0u] > rawTarget)
                {
                    `$INSTANCE_NAME`_curRamSnsPtr->idacComp[0u] &= (uint8)(~curIdacMask);
                }
                `$INSTANCE_NAME`_curRamSnsPtr->idacComp[0u] |= nextIdacMask;

                #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
                    if (`$INSTANCE_NAME`_curRamSnsPtr->raw[1u] > rawTarget)
                    {
                        `$INSTANCE_NAME`_curRamSnsPtr->idacComp[1u] &= (uint8)(~curIdacMask);
                    }

                    if (`$INSTANCE_NAME`_curRamSnsPtr->raw[2u] > rawTarget)
                    {
                        `$INSTANCE_NAME`_curRamSnsPtr->idacComp[2u] &= (uint8)(~curIdacMask);
                    }

