BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.c
                    `$INSTANCE_NAME`_curRamSnsPtr->idacComp[1u] |= nextIdacMask;
                    `$INSTANCE_NAME`_curRamSnsPtr->idacComp[2u] |= nextIdacMask;
                #endif
                `$INSTANCE_NAME`_curRamSnsPtr++;
            }

            /*  Shift both current idac and pre Idac values to right by 1   */
            curIdacMask = nextIdacMask;
            nextIdacMask = nextIdacMask >> 1u;
        }
        while (curIdacMask != 0u);
    }
}

#endif /* (`$INSTANCE_NAME`_CSX_IDAC_AUTOCAL_EN == `$INSTANCE_NAME`_ENABLE) */

/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCSXStartSample
****************************************************************************//**
*
* \brief
*   Starts scanning for the CSX widget.
*
* \details
*   Starts scanning for the CSX widget.
*
*******************************************************************************/
static void `$INSTANCE_NAME`_SsCSXStartSample(void)
{
    uint32 tmpRegVal;

    #if (`$INSTANCE_NAME`_ENABLE != `$INSTANCE_NAME`_BLOCK_OFF_AFTER_SCAN_EN)
        #if(`$INSTANCE_NAME`_CSX_ANALOG_STARTUP_DELAY_US > 0uL)
            Cy_SysLib_DelayUs(`$INSTANCE_NAME`_CSX_ANALOG_STARTUP_DELAY_US);
        #endif /* (`$INSTANCE_NAME`_CSX_ANALOG_STARTUP_DELAY_US > 0uL) */
    #endif /* (`$INSTANCE_NAME`_ENABLE != `$INSTANCE_NAME`_BLOCK_OFF_AFTER_SCAN_EN) */

    tmpRegVal = (uint32)`$INSTANCE_NAME`_curRamSnsPtr->idacComp[`$INSTANCE_NAME`_scanFreqIndex];
    tmpRegVal = (tmpRegVal & `$INSTANCE_NAME`_CSD_IDACA_VAL_MSK) | `$INSTANCE_NAME`_DEFAULT_CSD_IDACA_CFG;
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_IDACA_PTR, tmpRegVal);

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
        /* Configure node-specific number of sub-conversion */
        `$INSTANCE_NAME`_csxScanPeriod = `$INSTANCE_NAME`_SsCSXOversample();
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_SEQ_NORM_CNT_PTR, (uint32)`$INSTANCE_NAME`_curRamSnsPtr->subConvNum);
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */

    /* Clear scan result holder */
    `$INSTANCE_NAME`_csxRawCount = 0u;

    #ifdef `$INSTANCE_NAME`_START_SAMPLE_CALLBACK
        `$INSTANCE_NAME`_StartSampleCallback(`$INSTANCE_NAME`_widgetIndex, `$INSTANCE_NAME`_sensorIndex);
    #endif /* `$INSTANCE_NAME`_START_SAMPLE_CALLBACK */

    `$INSTANCE_NAME`_SsCSXStartSampleExt();
}

/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSXConnectTx
****************************************************************************//**
*
* \brief
*  Connects a TX electrode to the CSX scanning hardware.
*
* \details
*  This function connects a port pin (Tx electrode) to the CSD_SENSE signal.
*  It is assumed that drive mode of the port pin is already set to STRONG
*  in the HSIOM_PORT_SELx register.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time when there is only one port pin for an
*  electrode for example).
*
* \param  txPtr
*  Specifies the pointer to the FLASH_IO_STRUCT object belonging to a sensor
*  to be connected to the CapSense block as a Tx pin.
*
*******************************************************************************/
void `$INSTANCE_NAME`_CSXConnectTx(`$INSTANCE_NAME`_FLASH_IO_STRUCT const *txPtr)
{
    uint32 interruptState;

    interruptState = Cy_SysLib_EnterCriticalSection();

    Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)txPtr->pcPtr, (uint32)txPtr->pinNumber, CY_GPIO_DM_STRONG_IN_OFF);
    Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)txPtr->pcPtr, (uint32)txPtr->pinNumber, (en_hsiom_sel_t)`$INSTANCE_NAME`_HSIOM_SEL_CSD_SHIELD);

    Cy_SysLib_ExitCriticalSection(interruptState);
}

/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSXConnectRx
****************************************************************************//**
*
* \brief
*  Connects an RX electrode to the CSX scanning hardware.
*
* \details
*  This function connects a port pin (Rx electrode) to AMUXBUS-A and sets
*  drive mode of the port pin to High-Z in the GPIO_PRT_PCx register.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time when there is only one port pin for an
*  electrode for example).
*
* \param  rxPtr
*  Specifies the pointer to the FLASH_IO_STRUCT object belonging to a sensor
*  to be connected to the CapSense block as an Rx pin.
*
*******************************************************************************/
void `$INSTANCE_NAME`_CSXConnectRx(`$INSTANCE_NAME`_FLASH_IO_STRUCT const *rxPtr)
{
    uint32 interruptState;

    interruptState = Cy_SysLib_EnterCriticalSection();

    Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)rxPtr->pcPtr, (uint32)rxPtr->pinNumber, CY_GPIO_DM_ANALOG);
    Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)rxPtr->pcPtr, (uint32)rxPtr->pinNumber, (en_hsiom_sel_t)`$INSTANCE_NAME`_HSIOM_SEL_AMUXA);

    Cy_SysLib_ExitCriticalSection(interruptState);
}

/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSXDisconnectTx
****************************************************************************//**
*
* \brief
*  Disconnects a TX electrode from the CSX scanning hardware.
*
* \details
*  This function disconnects a port pin (Tx electrode) from the CSD_SENSE
*  signal and configures the port pin to the strong drive mode. It is assumed
*  that the data register (GPIO_PRTx_DR) of the port pin is already 0.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time when there is only one port pin for an
*  electrode for example).
*
* \param  txPtr
*  Specifies the pointer to the FLASH_IO_STRUCT object belonging to a Tx pin
*  sensor to be disconnected from the CapSense block.
*
*******************************************************************************/
void `$INSTANCE_NAME`_CSXDisconnectTx(`$INSTANCE_NAME`_FLASH_IO_STRUCT const *txPtr)
{
    uint32 interruptState;

