BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.c
    interruptState = Cy_SysLib_EnterCriticalSection();
    Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)txPtr->pcPtr, (uint32)txPtr->pinNumber, (en_hsiom_sel_t)`$INSTANCE_NAME`_HSIOM_SEL_GPIO);
    Cy_SysLib_ExitCriticalSection(interruptState);
}

/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSXDisconnectRx
****************************************************************************//**
*
* \brief
*  Disconnects an RX electrode from the CSX scanning hardware.
*
* \details
*  This function disconnects a port pin (Rx electrode) from AMUXBUS_A and
*  configures the port pin to the strong drive mode. It is assumed that the
*  data register (GPIO_PRTx_DR) of the port pin is already 0.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time when there is only one port pin for
*  an electrode for example).
*
* \param  rxPtr
*  Specifies the pointer to the FLASH_IO_STRUCT object belonging to an Rx pin
*  sensor to be disconnected from the CapSense block.
*
*******************************************************************************/
void `$INSTANCE_NAME`_CSXDisconnectRx(`$INSTANCE_NAME`_FLASH_IO_STRUCT const *rxPtr)
{
    uint32  interruptState;

    interruptState = Cy_SysLib_EnterCriticalSection();

    Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)rxPtr->pcPtr, (uint32)rxPtr->pinNumber, (en_hsiom_sel_t)`$INSTANCE_NAME`_HSIOM_SEL_GPIO);
    Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)rxPtr->pcPtr, (uint32)rxPtr->pinNumber, CY_GPIO_DM_STRONG_IN_OFF);
    Cy_GPIO_Clr((GPIO_PRT_Type*)rxPtr->pcPtr, (uint32)rxPtr->pinNumber);

    Cy_SysLib_ExitCriticalSection(interruptState);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCSXGetTxClkDivider
****************************************************************************//**
*
* \brief
*  This function gets the Sense Clock Divider value for one-dimension widgets
*  and the Column Sense Clock divider value for two-dimension widgets.
*
* \details
*  This function gets the Sense Clock Divider value based on the component
*  configuration. The function is applicable for one-dimension widgets and for
*  two-dimension widgets.
*
* \param
*  widgetId Specifies the ID of the widget.
*
* \return The Sense Clock Divider value for one-dimension widgets
*         and the Column Sense Clock divider value for two-dimension widgets.
*
*******************************************************************************/
uint32 `$INSTANCE_NAME`_SsCSXGetTxClkDivider(uint32 widgetId)
{
    uint32 retVal;

    /* Get sense divider based on configuration */
    #if (`$INSTANCE_NAME`_DISABLE == `$INSTANCE_NAME`_CSX_COMMON_TX_CLK_EN)
        `$INSTANCE_NAME`_RAM_WD_BASE_STRUCT *ptrWdgt;

        ptrWdgt = (`$INSTANCE_NAME`_RAM_WD_BASE_STRUCT *)
        `$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].ptr2WdgtRam;

        retVal = (uint32)(ptrWdgt->snsClk);
    #else
        retVal = (uint32)`$INSTANCE_NAME`_dsRam.snsCsxClk;
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_COMMON_TX_CLK_EN) */

    if(widgetId == 0uL)
    {
        ;
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCalcCsxScanPeriod
****************************************************************************//**
*
* \brief
*   Calculates scan  period for CSX
*
* \details
*   This function calculates scan period for CSX considering
*
* \param  wdgtPtr The pointer to a register map object that contains widget
*                     information.
*
* \return     Returns the CSX scan period for the widget.
*
*******************************************************************************/
static uint16 `$INSTANCE_NAME`_SsCalcCsxScanPeriod(`$INSTANCE_NAME`_RAM_WD_BASE_STRUCT const *wdgtPtr)
{
    uint32 temp;

    #if(`$INSTANCE_NAME`_DISABLE == `$INSTANCE_NAME`_CSX_COMMON_TX_CLK_EN)
        temp = (uint32)(wdgtPtr->snsClk);
    #else
        temp = (uint32)(`$INSTANCE_NAME`_dsRam.snsCsxClk);
    #endif /* (`$INSTANCE_NAME`_DISABLE == `$INSTANCE_NAME`_CSX_COMMON_TX_CLK_EN) */

    temp = CY_LO16((uint32)wdgtPtr->resolution * (temp - `$INSTANCE_NAME`_CSX_DEADBAND_CYCLES_NUMBER));

    /*  return the scan period */
    return ((uint16)temp);
}


/**
* \if SECTION_CAPSENSE_INTERRUPT
* \addtogroup group_capsense_interrupt
* \{
*/
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSXScanISR
****************************************************************************//**
*
* \brief
*  This is an internal ISR function to handle the CSX sensing method operation.
*
* \details
*  This handler covers the following functionality:
*   - Read the result of the measurement and store it into the corresponding register of
*     the data structure.
*   - If the Noise Metric functionality is enabled then check the number of bad
*     conversions and repeat the scan of the current sensor of the number of bad
*     conversions is greater than the Noise Metric Threshold.
*   - Initiate the scan of the next sensor for multiple sensor scanning mode.
*   - Update the Status register in the data structure.
*   - Switch the CSDv2 HW IP block to the default state if scanning of all the sensors is
*     completed.
*
*******************************************************************************/
void `$INSTANCE_NAME`_CSXScanISR(void)
{
    #if(0u != `$INSTANCE_NAME`_CSX_NOISE_METRIC_EN)
        uint32 tmpRegVal;
    #endif /* (0u != `$INSTANCE_NAME`_CSX_NOISE_METRIC_EN) */

    /* Disable interrupt */
    #if defined(`$INSTANCE_NAME`_ISR__INTC_ASSIGNED)
        NVIC_DisableIRQ(`$INSTANCE_NAME`_ISR_cfg.intrSrc);
    #endif

    /* Clear all pending interrupts of CSD block */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_INTR_PTR, `$INSTANCE_NAME`_CSD_INTR_ALL_MSK);
    (void)CY_GET_REG32(`$INSTANCE_NAME`_CSD_INTR_PTR);

    `$INSTANCE_NAME`_csxRawCount  = (uint16)(`$INSTANCE_NAME`_CSD_RESULT_VAL1_REG &
                                             `$INSTANCE_NAME`_CSD_RESULT_VAL1_VALUE_MSK);

    `$INSTANCE_NAME`_csxRawCount += (uint16)(`$INSTANCE_NAME`_CSD_RESULT_VAL2_REG &
                                             `$INSTANCE_NAME`_CSD_RESULT_VAL2_VALUE_MSK);

    /* This workaround neded to prevent overflow in the SW register map. Cypress ID #234358 */
    if(`$INSTANCE_NAME`_csxRawCount > `$INSTANCE_NAME`_csxScanPeriod)
    {
        `$INSTANCE_NAME`_csxRawCount = `$INSTANCE_NAME`_csxScanPeriod;
    }

#if(0u != `$INSTANCE_NAME`_CSX_NOISE_METRIC_EN)
    tmpRegVal = CY_GET_REG32(`$INSTANCE_NAME`_CSD_RESULT_VAL1_PTR) >> `$INSTANCE_NAME`_CSD_RESULT_VAL1_BAD_CONVS_POS;

    if((tmpRegVal > `$INSTANCE_NAME`_CSX_NOISE_METRIC_TH) && (`$INSTANCE_NAME`_resamplingCyclesCnt > 0uL))
    {
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_SEQ_START_PTR, `$INSTANCE_NAME`_SCAN_CSD_SEQ_START_CFG);
        `$INSTANCE_NAME`_resamplingCyclesCnt--;
    }
    else
    {
        `$INSTANCE_NAME`_CSXPostScanApiPtr();
        `$INSTANCE_NAME`_resamplingCyclesCnt = `$INSTANCE_NAME`_RESAMPLING_CYCLES_MAX_NUMBER;
    }
#else
    `$INSTANCE_NAME`_CSXPostScanApiPtr();
#endif /* (0u != `$INSTANCE_NAME`_CSX_NOISE_METRIC_EN) */

