BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.c
    if(`$INSTANCE_NAME`_NOT_BUSY == (`$INSTANCE_NAME`_dsRam.status & `$INSTANCE_NAME`_SW_STS_BUSY))
    {
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_CONFIG_PTR, `$INSTANCE_NAME`_DEFAULT_CSD_CONFIG_CFG);
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_CSDCMP_PTR, `$INSTANCE_NAME`_DEFAULT_CSD_CSDCMP_CFG);
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_IDACA_PTR,  `$INSTANCE_NAME`_DEFAULT_CSD_IDACA_CFG);
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_IO_SEL_PTR, `$INSTANCE_NAME`_DEFAULT_CSD_SW_IO_SEL_CFG);
    }

    /* Enable interrupt */
    #if defined(`$INSTANCE_NAME`_ISR__INTC_ASSIGNED)
        NVIC_EnableIRQ(`$INSTANCE_NAME`_ISR_cfg.intrSrc);
    #endif
}
/** \}
* \endif */


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCSXStartSampleExt
****************************************************************************//**
*
* \brief
*   Starts the CSDV2 sequencer to perform the CSX conversion.
*   specific widget.
*
* \details
*   This function covers the following functionality:
*      1. Configures the CSDV2 sequencer to perform the coarse initialization.
*      2. Waiting for completion of the coarse initialization.
*      3. Configures the CSDV2 sequencer to perform the normal conversion.
*      4. Starts the normal conversion
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_SsCSXStartSampleExt(void)
{
    uint32 filterDelay;
    uint32 watchdogCounter;
    #if (`$INSTANCE_NAME`_MOD_CSD_CLK_12MHZ < CYDEV_CLK_PERICLK__HZ)
        uint32 sampleClkFreqHz;
    #endif /* (`$INSTANCE_NAME`_MOD_CSD_CLK_12MHZ < CYDEV_CLK_PERICLK__HZ) */

    /* Configure the CSDV2 sequencer to perform the coarse initialization. */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_CONFIG_PTR,           `$INSTANCE_NAME`_DEFAULT_CSD_CONFIG_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_HSCMP_PTR,            `$INSTANCE_NAME`_PRECHARGE_CSD_HSCMP_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_PTR,      `$INSTANCE_NAME`_PRECHARGE_CSD_SW_HS_P_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_HS_N_SEL_PTR,      `$INSTANCE_NAME`_PRECHARGE_CSD_SW_HS_N_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_DSI_SEL_PTR,       `$INSTANCE_NAME`_PRECHARGE_CSD_SW_DSI_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_PTR,    `$INSTANCE_NAME`_PRECHARGE_CSD_SW_SHIELD_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_PTR,    `$INSTANCE_NAME`_PRECHARGE_CSD_SW_FW_MOD_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_PTR,   `$INSTANCE_NAME`_PRECHARGE_CSD_SW_FW_TANK_SEL_CFG);

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_BLOCK_OFF_AFTER_SCAN_EN)
        #if(`$INSTANCE_NAME`_CSX_ANALOG_STARTUP_DELAY_US > 0uL)
            Cy_SysLib_DelayUs(`$INSTANCE_NAME`_CSX_ANALOG_STARTUP_DELAY_US);
        #endif /* (`$INSTANCE_NAME`_CSX_ANALOG_STARTUP_DELAY_US > 0uL) */
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_BLOCK_OFF_AFTER_SCAN_EN) */

    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SEQ_START_PTR,        `$INSTANCE_NAME`_PRECHARGE_CSD_SEQ_START_CFG);

    /* Wait for the HSCMP trigger and retutn the sequencer to the IDLE state. */
    watchdogCounter = `$INSTANCE_NAME`_CSX_PRECHARGE_WATCHDOG_CYCLES_NUM;
    while((0u != (`$INSTANCE_NAME`_CSD_SEQ_START_START_MSK & CY_GET_REG32(`$INSTANCE_NAME`_CSD_SEQ_START_PTR))) && (0u != watchdogCounter))
    {
        watchdogCounter--;
    }

    /* Reset the sequencer to the IDLE state if HSCMP not triggered till watchdog period is out. */
    if(0u != (`$INSTANCE_NAME`_CSD_SEQ_START_START_MSK & CY_GET_REG32(`$INSTANCE_NAME`_CSD_SEQ_START_PTR)))
    {
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_SEQ_START_PTR,  `$INSTANCE_NAME`_DEFAULT_CSD_SEQ_START_CFG);
    }

    #if (`$INSTANCE_NAME`_MOD_CSD_CLK_12MHZ < CYDEV_CLK_PERICLK__HZ)
        sampleClkFreqHz = CYDEV_CLK_PERICLK__HZ / (uint32)`$INSTANCE_NAME`_dsRam.modCsxClk;
        if(sampleClkFreqHz <= `$INSTANCE_NAME`_MOD_CSD_CLK_12MHZ)
        {
            filterDelay = `$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_12MHZ;
        }
        else if(sampleClkFreqHz <= `$INSTANCE_NAME`_MOD_CSD_CLK_24MHZ)
        {
            filterDelay = `$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_24MHZ;
        }
        else
        {
            filterDelay = `$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_48MHZ;
        }
    #else
        filterDelay = `$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_12MHZ;
    #endif /* (`$INSTANCE_NAME`_MOD_CSD_CLK_12MHZ < CYDEV_CLK_PERICLK__HZ) */

    /* Configure the CSDV2 sequencer to perform the normal conversion. */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_CONFIG_PTR,           `$INSTANCE_NAME`_PRESCAN_CSD_CONFIG_CFG | filterDelay);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_CSDCMP_PTR,           `$INSTANCE_NAME`_PRESCAN_CSD_CSDCMP_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_HSCMP_PTR,            `$INSTANCE_NAME`_DEFAULT_CSD_HSCMP_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_PTR,      `$INSTANCE_NAME`_DEFAULT_CSD_SW_HS_P_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_HS_N_SEL_PTR,      `$INSTANCE_NAME`_DEFAULT_CSD_SW_HS_N_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_DSI_SEL_PTR,       `$INSTANCE_NAME`_DEFAULT_CSD_SW_DSI_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_IO_SEL_PTR,           `$INSTANCE_NAME`_SCAN_CSD_SW_IO_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_PTR,    `$INSTANCE_NAME`_DEFAULT_CSD_SW_SHIELD_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_PTR,    `$INSTANCE_NAME`_DEFAULT_CSD_SW_FW_MOD_SEL_CFG);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_PTR,   `$INSTANCE_NAME`_DEFAULT_CSD_SW_FW_TANK_SEL_CFG);

    /* Clear all pending interrupts of CSD block */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_INTR_PTR, `$INSTANCE_NAME`_CSD_INTR_ALL_MSK);
    (void)CY_GET_REG32(`$INSTANCE_NAME`_CSD_INTR_PTR);

    /* Start the normal conversion. */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SEQ_START_PTR, `$INSTANCE_NAME`_SCAN_CSD_SEQ_START_CFG);
}

#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
    /*******************************************************************************
    * Function Name: `$INSTANCE_NAME`_SsCSXOversample
    ****************************************************************************//**
    *
    * \brief
    *   Calculates the scan period of specific node.
    *
    * \details
    *   Calculates the scan period of specific node that is used as maximum
    *   raw count at raw count inversion (`$INSTANCE_NAME`_csxScanPeriod variable).
    *   The `$INSTANCE_NAME`_curFlashWdgtPtr and `$INSTANCE_NAME`_curRamSnsPtr
    *   must be configured to proper widget/sensor before calling this function.
    *
    * \return
    *   Returns the scan period of specific node (used as maximum raw count)
    *
    *******************************************************************************/
    uint32 `$INSTANCE_NAME`_SsCSXOversample(void)
    {
        uint32 result;
        #if(`$INSTANCE_NAME`_DISABLE == `$INSTANCE_NAME`_CSX_COMMON_TX_CLK_EN)
            `$INSTANCE_NAME`_RAM_WD_BASE_STRUCT * curRamWdgtBasePtr;
        #endif

        /*  Find scan period */
        #if(`$INSTANCE_NAME`_DISABLE == `$INSTANCE_NAME`_CSX_COMMON_TX_CLK_EN)
            curRamWdgtBasePtr = (`$INSTANCE_NAME`_RAM_WD_BASE_STRUCT *)`$INSTANCE_NAME`_curFlashWdgtPtr->ptr2WdgtRam;
            result = CY_LO16((uint32)`$INSTANCE_NAME`_curRamSnsPtr->subConvNum *
                (curRamWdgtBasePtr->snsClk - `$INSTANCE_NAME`_CSX_DEADBAND_CYCLES_NUMBER));
        #else
            result = CY_LO16((uint32)`$INSTANCE_NAME`_curRamSnsPtr->subConvNum *
                (`$INSTANCE_NAME`_dsRam.snsCsxClk - `$INSTANCE_NAME`_CSX_DEADBAND_CYCLES_NUMBER));
        #endif

        return result;
    }
#endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */

#endif  /* (0u != `$INSTANCE_NAME`_CSX_EN) */


/* [] END OF FILE */
